[{"name": "fairlife Lactose Free Fat Free Ultra Filtered Milk, 52 fl oz", "brand": "fairlife", "shortDescription": "We are driven by a simple belief: we can always make the world better.Proper nourishment allows us all to grow and thrive. At fairlife, we provide the health and vitality people need by starting with the wholesome simplicity of real cow’s milk.All our milk flows through soft filters to concentrate its goodness like protein and calcium while filtering out some of the natural sugars. Our delicious and satisfying fairlife Fat-Free Ultra-Filtered Milk has 50% less sugar and 50% more protein than regular milk. Plus, there’s no artificial growth hormones used and it’s lactose free.So sip, drink and chug as you enjoy our delicious ultra-filtered milk.", "canonicalUrl": "https://www.walmart.com/ip/fairlife-Lactose-Free-Fat-Free-Ultra-Filtered-Milk-52-fl-oz/43984342", "availabilityStatus": "IN_STOCK", "averageRating": 4.4, "priceInfo": {"currentPrice": {"price": 4.38, "priceString": "$4.38"}, "unitPrice": {"price": 0.084, "priceString": "8.4 ¢/fl oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Ready to drink"}], "indications": null, "specifications": [{"name": "Brand", "value": "fairlife"}, {"name": "Container Type", "value": "Bottle"}, {"name": "Flavor", "value": "Milk"}, {"name": "Food Allergen Statements", "value": "Contains Milk"}, {"name": "Allergen-Free Statements", "value": "Lactose-Free"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "3.76 x 3.76 x 9.84 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "80", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "0g", "dvp": "0%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "0.0g", "dvp": "0%"}, {"name": "Trans Fat", "amount": "0.0g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "5.0mg", "dvp": "2%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "120.0mg", "dvp": "5%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "6g", "dvp": "2%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0.0g", "dvp": "0%"}, {"name": "Sugars", "amount": "6.0g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": "13.0g", "dvp": "26%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": null, "dvp": "20%"}, {"name": "Vitamin C", "amount": null, "dvp": "0%"}, {"name": "Calcium", "amount": null, "dvp": "40%"}, {"name": "Potassium", "amount": "400.0mg", "dvp": "11%"}, {"name": "Iron", "amount": null, "dvp": "0%"}, {"name": "Vitamin D", "amount": null, "dvp": "25%"}, {"name": "Riboflavin", "amount": null, "dvp": "20%"}, {"name": "Vitamin B12", "amount": null, "dvp": "20%"}, {"name": "Phosphorus", "amount": null, "dvp": "25%"}, {"name": "Magnesium", "amount": null, "dvp": "6%"}, {"name": "Zinc", "amount": null, "dvp": "10%"}]}}}, "reviews": {"averageOverallRating": 4.415, "customerReviews": [{"rating": 5.0, "reviewText": "I have got a coupon to receive one of these at a lower price either the low fat milk or chocolate and i got the chocolate version and i love it! so much it taste like straight up chocolate milk with whip cream and i loved it so much. i highly recommend this so anyone who is lactose free and want a better source of dairy this it the to go to product! from this point forward i have been buying his brand of milk Fairlife because its so much better and half the sugar of actual regular milk."}, {"rating": 5.0, "reviewText": "The Fairlife Milk 52 fl oz - Lactose Free Fat Free Skim Milk in my opinion is a perfect addition to changing my milk intake for my morning breakfast without making me feel like I'm drinking watery milk. My experience during and after my pregnancy I've turned lactose intolerant and even when I've tried other milks and replacement milks, they have a fatty after taste which made me gag a bit but with fairlife skim the milk taste full in texture, also light feel without the fatty taste or feel of other skim milk brands and it let's me eat cereal and doesn't over take the flavor away from my cereal. One cup is enough for me to feel fulfilled. Drink within 14 days for freshness."}, {"rating": 5.0, "reviewText": "Fairlife milk with lactose free and fat reduced chocolate milk was a score for our family. The chocolate milk is rich and full of flavor, and 2% milk. Our family considers this a winner, and it was gone in 2-days. It has 50% less sugar, no growth hormones, and is high in protein."}, {"rating": 5.0, "reviewText": "Fairlife Chocolate 2% Reduced Fat Ultra-Filtered Milk is lactose free and has 43% less fat than whole ultra-filtered milk. It contains 13 grams of protein, 9 essential nutrients, and only 140 calories per 1 cup serving. This milk is so creamy and delicious, almost like a milk shake, just not in frozen form. It is medium-dark in colour and has the most chocolatey taste. If you tend to get a chocolate craving, like I do occasionally, this would be a great alternative to get your chocolate “fix” and some nutrients in the process. I think kids will LOVE this beverage! The bottle indicates that you should use within 14 days of opening—don't worry, it won't last that long! I would recommend this product."}, {"rating": 5.0, "reviewText": "I am so glad I was able to locate Fairlife Milk 52 fl oz - Lactose Free 2% Chocolate Milk at my local Walmart. I have seen this time and again but thought that it would taste like every other Chocolate Milk out there. Quite contrary to that belief. Not only does this amazing Fairlife Chocolate Milk taste like a thick shake (unlike other Chocolate Milk's) but this is 2% Milk with Lactose which cuts the sugars in half of that of other chocolate milks but it also has no hormones. It has 13g of Protein per serving and you get 52 fl oz. I am not a big milk drinker but this is something I could see myself enjoying quite often. Its not only a treat but with half the sugars its really a healthy alternative to other chocolate milk's and chocolate drinks. I highly recommend this Fairlife Chocolate Milk!"}, {"rating": 5.0, "reviewText": "I did a side by side taste test of this to the normal milk we buy. They tasted identical. But this somehow has 50% less sugar and 13g of protein per serving. Howwww! It's also lactose free. Again I say HOWWWW. I've never tasted better lactose free milk. As far as taste goes this is the milk you want if you are looking for high quality that tastes the same. It also still contains 9 essential nutrients. Awesome!!"}, {"rating": 5.0, "reviewText": "I can't drink milk without getting ill. I tried this milk and to my shocked mouth, it has a full milk taste. \r\nIf I had heard of this sooner I would have bought it. There is no gross after taste either. I found the size of the bottle ok for me who is disabled. I could carry it. But boy thins would be the best on some cereal. When I first tasted it I thought it was like Parmalat milk which is also great for those who get ill drinking regular milk. \r\n\r\nIt was hard finding a store to get this one."}, {"rating": 4.0, "reviewText": "The Fairlife Milk 52 fl oz-Lactose Free Reduced Fat 2% Milk is much easier on my stomach than regular milk. I have a few stomach issues and being lactose intolerant is one of them. The Fairlife milk tastes just like regular milk, it just doesn't cause the belly pain. It's also got a lot of protein in it . I received this product for free as a Spark Reviewer."}, {"rating": 2.0, "reviewText": "The expiration date on this particular item was from 2013. Items that are picked up by shoppers need to be date checked before they bag them and send them to Customer. I am requesting a refund for this item or a new bottle to be sent to me."}, {"rating": 1.0, "reviewText": "It was given to me damaged...the whole top was smashed in"}], "totalReviewCount": 3053}}, {"name": "Magnolia Fat Free Sweetened Condensed Milk, 14 Oz", "brand": "Magnolia", "shortDescription": "Just Milk and Sugar (- Fat). That’s it! Made with real, simple ingredients, Magnolia Sweetened Condensed Milk provides an authentic taste for your favorite Latin and American recipes. Easy to use, you can use the whole can in your favorite desserts, or drizzle some on fruit, pancakes, or in drinks like coffee and tea to add a touch of rich, creamy flavor and joy. Now, you can enjoy it with a little less guilt.  With almost 70 years of heritage, Magnolia Sweetened Condensed Milk is a brand consumers trust to make every recipe special. We use real, fresh milk and no rBST, and no artificial flavors. We are proud to offer consumers with a product that is Real Seal Certified, Certified Gluten-Free, and Kosher (KOK-Dairy). We stand by Magnolia’s high quality to give you the high-quality ingredients for all of your baking needs. Whether it is for the classics, like gourmet, indulgent Caramel Flan, or soft, luscious Tres Leches cake, or something new, Magnolia is a brand you can trust while you make all of the good stuff.  Flavor you love, quality you trust, at an affordable price.", "canonicalUrl": "https://www.walmart.com/ip/Magnolia-Fat-Free-Sweetened-Condensed-Milk-14-Oz/43003233", "availabilityStatus": "IN_STOCK", "averageRating": 4.8, "priceInfo": {"currentPrice": {"price": 2.27, "priceString": "$2.27"}, "unitPrice": {"price": 0.162, "priceString": "16.2 ¢/oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Refrigerate after opening. Best if used by date shown on end of can. Store in a cool, dry place. Cut along dotted line for recipe on back."}], "indications": null, "specifications": [{"name": "Brand", "value": "Magnolia"}, {"name": "Assembled Product Weight", "value": "1.0425 POUNDS"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "2.95 x 2.95 x 3.31 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "110", "dvp": "1%"}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "0g", "dvp": "0%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "0g", "dvp": "0%"}, {"name": "Trans Fat", "amount": "0g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "0.00mg", "dvp": "0%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "55.0mg", "dvp": "2%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "25g", "dvp": "8%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0g", "dvp": "0%"}, {"name": "Sugars", "amount": "25.0g", "dvp": "40%"}]}, {"mainNutrient": {"name": "Protein", "amount": "4.0g", "dvp": "8%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": ".2", "dvp": "4%"}, {"name": "Vitamin C", "amount": null, "dvp": "0%"}, {"name": "Calcium", "amount": "110", "dvp": "1%"}, {"name": "Potassium", "amount": null, "dvp": "4%"}, {"name": "Iron", "amount": null, "dvp": "0%"}, {"name": "Vitamin D", "amount": null, "dvp": "0%"}]}}}, "reviews": {"averageOverallRating": 4.8333, "customerReviews": [{"rating": 4.0, "reviewText": "Great taste, great price not much you say about condensed milk"}, {"rating": 5.0, "reviewText": null}, {"rating": 5.0, "reviewText": null}, {"rating": 5.0, "reviewText": null}, {"rating": 5.0, "reviewText": null}, {"rating": 5.0, "reviewText": null}], "totalReviewCount": 6}}, {"name": "Silk Shelf-Stable Unsweetened Almond Milk, 1 Quart", "brand": "Silk", "shortDescription": "<p>Bring the creamy goodness of almondmilk to your pantry with Silk Shelf-Stable Unsweetened Almondmilk. Featuring a pure, silky-smooth taste and just 30 calories per serving, this unsweetened almondmilk is delicious whether it’s poured over cereal, added to your favorite recipes, or enjoyed straight out of the glass. It makes a perfect non-dairy alternative to milk, and is totally free of dairy, soy, lactose, gluten, casein, egg, and MSG. Silk Almondmilk provides vitamin E and contains 50% more calcium than dairy milk.* And since it comes in special, shelf-stable packaging, this unsweetened nutmilk will keep fresh at room temperature, unopened, until the date code: no refrigeration necessary! <br></p><p>*Silk Unsweetened Original Almondmilk: 450mg of calcium per cup; reduced fat dairy milk: 293mg of calcium per cup. USDA National Nutrient Database for Standard Reference. Data consistent with typical reduced fat dairy milk.Here at Silk, we believe in making delicious plant-based food that does right by you and fuels our passion for the planet. Every delicious product we offer is made with plants, they’re naturally dairy-free, gluten-free, and cholesterol-free. And our entire lineup is enrolled in the Non-GMO Project Verification Program. Choose from an array of non-dairy products--from silky-smooth nutmilk to creamy, dreamy yogurt alternatives--and taste the goodness for yourself!<p><b>Silk Shelf-Stable Unsweetened Almond Milk, 1 Quart:</b>", "canonicalUrl": "https://www.walmart.com/ip/Silk-Shelf-Stable-Unsweetened-Almond-Milk-1-Quart/35902522", "availabilityStatus": "IN_STOCK", "averageRating": 3.5, "priceInfo": {"currentPrice": {"price": 13.17, "priceString": "$13.17"}, "unitPrice": null}, "idml": {"directions": [{"name": "Instructions", "value": "Ready to Drink"}], "indications": null, "specifications": [{"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Unsweetened"}, {"name": "Assembled Product Weight", "value": "2.1 lbs"}, {"name": "Food Form", "value": "Fresh"}, {"name": "Brand", "value": "Silk"}, {"name": "Model", "value": "1701"}, {"name": "Allergen-Free Statements", "value": "Dairy-Free, Gluten-Free, Artificial Flavor Free, Artificial Color Free, Soy /Soybean Free"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "3.70 x 2.20 x 7.70 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "30", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "2.5g", "dvp": "3%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "0.0g", "dvp": "0%"}, {"name": "Trans Fat", "amount": "0.0g", "dvp": null}, {"name": "Polyunsaturated Fat", "amount": "0.5g", "dvp": null}, {"name": "Monounsaturated Fat", "amount": "1.5g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "0.0mg", "dvp": "0%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "160.0mg", "dvp": "7%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "1g", "dvp": "0%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0.0g", "dvp": "4%"}, {"name": "Sugars", "amount": "0.0g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": "1g", "dvp": "0%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": "150.00mcg", "dvp": "10%"}, {"name": "Vitamin C", "amount": null, "dvp": "0%"}, {"name": "Calcium", "amount": "45", "dvp": "45%"}, {"name": "Potassium", "amount": "30.0mg", "dvp": "1%"}, {"name": "Iron", "amount": "0.50mg", "dvp": "2%"}, {"name": "Vitamin D", "amount": "2.50mcg", "dvp": "25%"}, {"name": "Vitamin E", "amount": "3.8mg", "dvp": "50%"}, {"name": "Riboflavin", "amount": null, "dvp": "30%"}, {"name": "Vitamin B12", "amount": null, "dvp": "50%"}, {"name": "Magnesium", "amount": null, "dvp": "4%"}, {"name": "Zinc", "amount": null, "dvp": "8%"}]}}}, "reviews": {"averageOverallRating": 3.5106, "customerReviews": [{"rating": 5.0, "reviewText": "I have no clue why no ones is talking about this. I don't know if you change the recipe or something but to me it taste the same as normal milk no difference. It also looks like real milk as well, its lighter then any other silk almond milk. Whatever you are doing to this please do it to your other milk products."}, {"rating": 5.0, "reviewText": "The negligible sugar/carb amount combined with the very low fat makes this the perfect milk for the various recipes of most diets. I've seen a lot of reviews where people hate the new formula, but I honestly can't tell the difference and I have been drinking it for years. I use it in protein shakes and cereal and even oatmeal and it tastes like milk to me. Thank You, Silk!!!"}, {"rating": 5.0, "reviewText": "I DON'T LIKE TO BUY SWEETENED VARIETIES OF ALMOND MILK, SO THIS UNSWEETETENED VERSION IS MY BEST OPTION I THINK. TASTES AMAZING!"}, {"rating": 5.0, "reviewText": "I love this almond milk the best! I hate dairy products, as they do harm to the human body. This milk goes great with my morning cereal and lunch time smoothie! No sugar added is a great thing about this milk! Also i love how it is part of the non-gmo product so I know this milk is trusty! I just prefer this milk out of all the silk brands. Although the others are great as well!"}, {"rating": 5.0, "reviewText": "My son has a milk protein allergy, and has been diagnosed since he was 2 months old. After formula this was our option and I couldn't be happier. He loves his milk and this will continue throughout the rest of his life, since he cannot tolerate cow's milk. Thank you Silk!"}, {"rating": 5.0, "reviewText": "I love both Silk almond and soy milk. It's the perfect milk for someone who's lactose intolerant but still love dairy. It's one of my main ingredients for smoothies. Sometimes I pour it on cold cereal, hot oatmeal, or my morning coffee. My favorite flavor is chocolate. I also love unsweetened vanilla."}, {"rating": 2.0, "reviewText": "I use to buy Silk Almond Unsweetened weekly, as well as the Chocolate Flavor Amond Milk. Love it! However I noticed recently that you no longer fortify with Vitamin B12. Vegans need food and drinks fortified with this essential vitamin. I'm switched to a Flax Milk now because they do add B12, not as high a percentage as Silk added but it's still better then nothing. Please reconsider!"}, {"rating": 1.0, "reviewText": "I just went to the store to get my typical Silk unsweetened almond milk and I see that the new formula has less calcium and less vitamen D than the old formula. That is really upsetting to me because Silk almond milk is one of my main sources of calcium. The old formula had 45% of daily calcium needs per serving while the new formula only has 30%. The old one had 25% of vitamen D needs and the new has only 10%. This is a big difference in nutritional value! (I have atraxhef a picture - new formula in the right and old formula in the left). Please bring back the old formula!!"}, {"rating": 1.0, "reviewText": "Good price. I like the product very much with my morning cereal, but when the two cartons I ordered arrived, the inner aluminum seals were already broken open. I bought a carton like this at a health food store. I returned them to Walmart (and the health food stores). No problem getting my money back. I bought more then. - - I really hope the Silk company takes notice of what's happening! The store clerks said that these broken aluminum seals were not due to the ABQ altitude."}, {"rating": 1.0, "reviewText": "Disappointed in SILK customer service. I called this morning to get some clarification on the ingredients and the actual carbohydrate count (value is listed as less than 1). The representative I spoke with knew nothing about the product other than what I could already read from the label. She had a poor attitude towards me and also toward my question. I would think a company that markets its products as 'health' conscious alternatives would welcome questions from the consumer about nutrient values."}], "totalReviewCount": 188}}, {"name": "Meyenberg Whole Goat Milk, 32 fl oz", "brand": "Meyenberg", "shortDescription": "<p>Enjoy the creamy goodness of Meyenberg Whole Goat Milk. Easier to digest than cow milk, it's a natural choice for those sensitive to cow dairy. Goat milk has smaller size fat particles which produce a smaller and softer curd in the stomach. The smaller, softer curds are more rapidly broken down by stomach enzymes, which make goat milk more easily digestible! High in calcium, magnesium and potassium, it's also a good source of vitamin D. Its sweet, rich flavor profile is distinctive and more complex than other milks, which means it’s delicious to drink on its own and ideal for recipes as well. Our fresh milk is available in whole or low fat, whole evaporated and powdered whole and nonfat varieties (each sold separately).Meyenberg has been bringing the goodness of goat milk products to folks from coast to coast for over 85 years.</p>", "canonicalUrl": "https://www.walmart.com/ip/Meyenberg-Whole-Goat-Milk-32-fl-oz/10818414", "availabilityStatus": "IN_STOCK", "averageRating": 4.3, "priceInfo": {"currentPrice": {"price": 5.23, "priceString": "$5.23"}, "unitPrice": {"price": 0.163, "priceString": "16.3 ¢/fl oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Keep refrigerated.Shake well."}, {"name": "Safe Handling Instructions", "value": "Keep Refrigerated. Best if opened by the sell-date that's listed on the package. Once opened, consume within 5 days. Shake Well."}], "indications": null, "specifications": [{"name": "Features", "value": "Ultra-pasteurized, Vitamin d, Easy to digest, Grade a, Kosher"}, {"name": "Brand", "value": "Meyenberg"}, {"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Unsweetened"}, {"name": "Food Allergen Statements", "value": "Contains Milk"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "2.90 x 2.90 x 9.00 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "140", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "7g", "dvp": "9%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "4g", "dvp": "20%"}, {"name": "Trans Fat", "amount": "0g", "dvp": null}, {"name": "Polyunsaturated Fat", "amount": "2.50g", "dvp": null}, {"name": "Monounsaturated Fat", "amount": "1.00g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "25.00mg", "dvp": "8%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "115mg", "dvp": "5%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "11g", "dvp": "4%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0g", "dvp": "0%"}, {"name": "Sugars", "amount": "11g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": "0g", "dvp": "16%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": null, "dvp": "6%"}, {"name": "Vitamin C", "amount": null, "dvp": "0%"}, {"name": "Calcium", "amount": "300.00mg", "dvp": "25%"}, {"name": "Potassium", "amount": "420mg", "dvp": "8%"}, {"name": "Iron", "amount": "0.00mg", "dvp": "0%"}, {"name": "Vitamin D", "amount": "3.00mcg", "dvp": "15%"}]}}}, "reviews": {"averageOverallRating": 4.3279, "customerReviews": [{"rating": 5.0, "reviewText": "I don't have digestive problems as long as I drink only this Meyenberg goat milk, 3 cups a day for calcium and protein.  Too expensive to cook with so I buy regular milk for that, but worth every penny for daily milk intake.  It makes the best chocolate milk in the world.   I'm very allergic to the A1 protein in Jersey milk which is 99% of the cow milk on the market so I hope Walmart keeps a consistent supply of this in stock!.   You can see I have over 2 gallons (9 quarts) in my fridge right now, since it has a long shelf life I can buy it a case at a time which is 3 gallons."}, {"rating": 5.0, "reviewText": "I love this!  I tried it because goat products are supposedly excellent for health and metabolism, but I will be drinking this for pleasure from now on!  To me is does not taste very 'goaty'.  I think it tastes much like regular milk but better.  Has a more robust, less sugary, more wholesome taste.  I drank the whole milk and I like that it is not \"ultra pasteurized\" as some are.  Wish I had discovered this sooner for the health benefits."}, {"rating": 5.0, "reviewText": "I have been wanting to try Goat milk for some time and just happen to see this Meyenberg Goat Milk at Walmart and purchased it. I was so surprised that it was so good and the more I drank of it, I found that it was - what I would call Smoother than cow's milk. (And I've been drinking Horizon Milk which tastes great!)\n\nI will state that I've had a very small allergic reaction to cow's milk all my life - nothing big, just that I always had to clear my throat, cough a little after eating cheese or drinking milk. Nothing that kept me from it.\nNONE of that has occurred after drinking this Goat's Milk.\n\nI'm sold on it! And hopefully our local Walmart will stock other products by Meyenberg.\nBy the way, I checked them out online & found out that the Goat Milk is Kosher!"}, {"rating": 5.0, "reviewText": "Wish it was not this expensive"}, {"rating": 5.0, "reviewText": "it's great for kittens when the mom doesn\" t have enough milk. They love it"}, {"rating": 5.0, "reviewText": "Tastes great, cheaper at Walmart than other places."}, {"rating": 5.0, "reviewText": "This product is vital and necessary for my pets!!   Why don't you carry anymore??"}, {"rating": 5.0, "reviewText": "As someone who loves goat milk this is some fantastic GOAT milk! Again yes GOAT milk does taste like other GOAT dairy products. It's almost like they are made out of the same thing…I mean who would have thunk it? GOAT milk tastes exactly like….(drum roll please)…..GOAT milk! Reading the bad reviews for this milk really makes me lose hope in humanity. If you hate goat milk fine, but review the product itself not the discovery of your hatred for goat milk because you have never tried it before. So if you like goat milk and are looking for an easy way to get it without waking up at 5am to milk teats or chasing down your goat owning neighbor begging to buy some then this is for you!"}, {"rating": 1.0, "reviewText": "I had just 11 pieces and I do not know how to let that I did not have 12"}, {"rating": 1.0, "reviewText": "item is expired"}], "totalReviewCount": 1101}}, {"name": "Great Value Extra Creamy Oatmilk, 59 fl oz", "brand": "Great Value", "shortDescription": "<p>Enjoy the smooth taste and silky texture of Great Value Extra Creamy Oatmilk on its own or in recipes in place of dairy milk. This nutritious beverage is a great option for people who are lactose-intolerant or who are just looking for something different. A good source of vitamins A, D, and zinc, it is also rich in calcium. You may even come to prefer the gentle flavor of oatmilk, and the half-gallon carton provides plenty for experimentation. It's delicious over cereal, in tea or coffee, in recipes, or all by itself. Stay healthy with Great Value Extra Creamy Oatmilk.</p><p>Great Value products provide families with affordable, high-quality grocery and household consumable options. With our wide range of product categories spanning grocery and household consumables, we offer you a variety of products for your family's needs. Our products are conveniently available online and in Walmart stores nationwide, allowing you to stock up and save money at the same time.</p><br />", "canonicalUrl": "https://www.walmart.com/ip/Great-Value-Extra-Creamy-Oatmilk-59-fl-oz/628809485", "availabilityStatus": "IN_STOCK", "averageRating": 4.2, "priceInfo": {"currentPrice": {"price": 3.78, "priceString": "$3.78"}, "unitPrice": {"price": 0.064, "priceString": "6.4 ¢/fl oz"}}, "idml": {"directions": [{"name": "Safe Handling Instructions", "value": "Keep Refrigerated."}], "indications": null, "specifications": [{"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Extra Creamy"}, {"name": "Food Form", "value": "Liquids"}, {"name": "Brand", "value": "Great Value"}, {"name": "Allergen-Free Statements", "value": "Dairy-Free"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "120", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "5g", "dvp": "0%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "17g", "dvp": "0%"}, "childNutrients": null}, {"mainNutrient": {"name": "Protein", "amount": "2g", "dvp": null}, "childNutrients": null}]}, "vitaminMinerals": null}}, "reviews": {"averageOverallRating": 4.1509, "customerReviews": [{"rating": 5.0, "reviewText": "Great taste for oatmilk and is my favorite of all that I've tried. I use it for black tea, if it matters, and don't use it for cooking or any other uses so that is all I can speak to."}, {"rating": 5.0, "reviewText": "This stuff is just what the doctor ordered (almost literally)! Tastes great (as opposed to skim milk), really low in sugar and fat, and goes well with my protein smoothies!"}, {"rating": 5.0, "reviewText": "Have repurchased this several times. I use it primarily for smoothies and coffee and really can't tell a difference from the name brands in those situations"}, {"rating": 5.0, "reviewText": "This is a GREAT alternative to cow's milk.  It is rich and creamy and drinks like a whole milk. Fantastic flavor and super creamy at a great price."}, {"rating": 5.0, "reviewText": "Yummy!  Tastes creamy like milk but without the icky, sour smell of real milk.  No chalky taste, no aftertaste."}, {"rating": 5.0, "reviewText": "Tried this hoping it would be similar to Oatly and it was! Kirkland brand oatmilk is a bit too sweet for me and was glad to find this was comparable to Oatly for a better price!"}, {"rating": 4.0, "reviewText": "Make it organic for 5/5 Stars!"}, {"rating": 1.0, "reviewText": "I got a expired milk"}, {"rating": 1.0, "reviewText": "Absolutely horrible, I purchased two cartons because they were out of my usual oat milk. I used it in my coffee and spit it out! I immediately pored both containers down the drain….I would have returned to the store but I don't live nearby a Walmart and with the drive it would not have been worth my time."}, {"rating": 1.0, "reviewText": "Terrible! Not \"extra creamy\" watery and gross. With canola oil 🤮"}], "totalReviewCount": 53}}, {"name": "Rice Dream Organic Original Rice Drink, 64 Fl. Oz.", "brand": "Rice Dream", "shortDescription": "Rice Dream Enriched Original Organic Rice Drink has a deliciously light and refreshing flavor with a hint of sweetness from brown rice. It's easy to digest and 99% fat-free with no cholesterol. Whether you pour it over cereal, add it to your favorite recipes or enjoy it cold by the glassful, our Enriched Original Organic Rice Drink is delicious any way you enjoy it. It is also USDA-Certified Organic, Non-GMO Project Verified and a good source of calcium and vitamins A, B12 & D. Perfect for people with dietary restrictions, our rice drink is Certified Kosher and free of common allergens including lactose, dairy and gluten. Includes one 64 Fl. Oz. carton of Rice Dream Enriched Original Organic Rice Drink. has redefined what's possible for the dairy-free with a large variety of plant-based offerings, including plant-based beverages, frozen desserts, yogurts and chocolate, all enrolled in the Non-GMO Project. They're nutritious and loaded with flavor, so you'll enjoy every sip and savor every bite. Discover how delicious Dream can be.", "canonicalUrl": "https://www.walmart.com/ip/Rice-Dream-Organic-Original-Rice-Drink-64-Fl-Oz/28645690", "availabilityStatus": "IN_STOCK", "averageRating": 4.6, "priceInfo": {"currentPrice": {"price": 5.23, "priceString": "$5.23"}, "unitPrice": {"price": 0.082, "priceString": "8.2 ¢/fl oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Shake well.Serve chilled.Stays fresh 7-10 days in refrigerator after opening."}], "indications": null, "specifications": [{"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Unflavored"}, {"name": "Assembled Product Weight", "value": "4 lbs"}, {"name": "Food Form", "value": "Liquids"}, {"name": "Brand", "value": "Rice Dream"}, {"name": "Model", "value": "M92230"}, {"name": "Allergen-Free Statements", "value": "Dairy-Free, Gluten-Free, Lactose-Free, Soy /Soybean Free"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "2.90 x 4.60 x 9.00 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "120", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "2.5g", "dvp": "4%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "0.0grm", "dvp": "0%"}, {"name": "Trans Fat", "amount": "0.0grm", "dvp": null}, {"name": "Polyunsaturated Fat", "amount": "0.5grm", "dvp": null}, {"name": "Monounsaturated Fat", "amount": "1.5grm", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "0.0mg", "dvp": "0%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "100.0mg", "dvp": "4%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "23g", "dvp": "8%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0.0grm", "dvp": "0%"}, {"name": "Sugars", "amount": "10g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": "1g", "dvp": "0%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": "90.00mcg", "dvp": "10%"}, {"name": "Vitamin C", "amount": null, "dvp": "0%"}, {"name": "Calcium", "amount": "280.00mg", "dvp": "30%"}, {"name": "Potassium", "amount": "30mg", "dvp": "0%"}, {"name": "Iron", "amount": "0.40mg", "dvp": "4%"}, {"name": "Vitamin D", "amount": "5.00mcg", "dvp": "25%"}, {"name": "Vitamin B12", "amount": "0.60mcg", "dvp": "25%"}, {"name": "Phosphorus", "amount": "150.00mg", "dvp": "10%"}]}}}, "reviews": {"averageOverallRating": 4.6325, "customerReviews": [{"rating": 5.0, "reviewText": "Thank you so much, great packing on the front door 👍🏼"}, {"rating": 5.0, "reviewText": "Rice milk is getting harder and harder to find and the price has drastically gone up by $2 more per carton!  We love it. Walmart has the cheapest price and delivered it (in bags) the next day. (I ordered it late at night or the delivery might have even been same day.)  It was perfect."}, {"rating": 5.0, "reviewText": "My son has been drinking this rice milk since he was two years old and he will be 15 in a few months.  He was allergic to dairy for the first 7 years of his life and then grew out of the allergy.  We are still buying this product becasue he loves it so much.  He refuses to drink any other milk!!!  For years I have been buying the ENRICHED so he gets the extra vitamins.  He is a strong and very healthy, lean teenager!!  I am grateful for this product!"}, {"rating": 5.0, "reviewText": "I love the product and will continue buying it from Walmart through ordering it online. The way they package it in a box is inadequate . They need to do better in that way."}, {"rating": 5.0, "reviewText": "I've been buying Rice \"milk\" forever. This is probably my favorite brand since there aren't really many to choose from outside of NY/NJ/CT. It's similar to skim cows milk consistency and is perfect on cereal. If you're going non-dairy for whatever reason buy this!"}, {"rating": 4.0, "reviewText": "I have a lot of difficulty getting to the store for fresh milk. I don't like soy milk at all, cashew milk and almond milk were gritting, coconut milk was OK but too watery. This is kind of like skim milk but it has a nice flavor and it doesn't have a strong flavor so I feel comfortable cooking with it but for the most part I use it on my cereal. It's so nice that I can buy several boxes and store them in the pantry then pop them in the fridge when I'm ready to use them. Once opened it seems to last longer than regular milk. I really love this stuff."}, {"rating": 4.0, "reviewText": "I usually put 3/4 of rice milk and 1/4 or less just for taste in my cereal.  Cuts down on milk intake.  This is also good for shakes--cant tell the difference between milk and rice milk when used for a shake.  Might make a taste difference in recipes though."}, {"rating": 2.0, "reviewText": "I keep ordering Rice Dream milk and receiving Dream rice milk. It's OK, but the packaging is poor. It has to be shaken, and the milk flies all over. I want Rice Dream back. If this is new packaging, you need to remove the old package pictured."}, {"rating": 1.0, "reviewText": "It was damaged at the top"}, {"rating": 1.0, "reviewText": "I test products/food before giving my children certain things. This stuff tasted like breastmilk.👎🏼 (Yeah, I tried my own breastmilk when I was breastfeeding...most breastfeeding mothers have...not ALL) Anywho, i might call my kiddos \"my babies\", but im sure as heck not giving them something that taste like human milk.\nWe will stick with other milk alternatives.\nI dumped that out and threw my \"Dream's\" in the trash!"}], "totalReviewCount": 117}}, {"name": "Great Value Unsweetened Vanilla Almondmilk, Half Gallon", "brand": "Great Value", "shortDescription": "1 cup of milk contains 20% DV calcium vs. 1 cup of Vanilla Unsweetened Almond milk contains 35% DV calcium.Enjoy the smooth and creamy flavor of Great Value Unsweetened Vanilla Almond milk. Our original almond milk is made from premium quality ingredients and comes with a mixture of healthy vitamins and minerals such as calcium and vitamins A, D, and E. Our vanilla almond milk is the perfect substitute for traditional milk in all your favorite dairy-laden dishes. Use it in your cereal, whirl it into a yummy smoothie, or even serve it alongside some chocolate chip cookies for a decadent dessert. Pour yourself a glass of Great Value Unsweetened Vanilla Almond milk.Great Value products provide families with affordable, high quality grocery and household consumable options. With our wide range of product categories spanning grocery and household consumables, we offer you a variety of products for your family's needs. Our products are conveniently available online and in Walmart stores nationwide, allowing you to stock up and save money at the same time.", "canonicalUrl": "https://www.walmart.com/ip/Great-Value-Unsweetened-Vanilla-Almondmilk-Half-Gallon/46491752", "availabilityStatus": "IN_STOCK", "averageRating": 3.8, "priceInfo": {"currentPrice": {"price": 2.44, "priceString": "$2.44"}, "unitPrice": {"price": 0.038, "priceString": "3.8 ¢/fl oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Shake well"}, {"name": "Safe Handling Instructions", "value": "DO NOT USE IF SEAL UNDER CAP IS BROKEN **NOT FOR USE AS AN INFANT FORMULA"}], "indications": [{"name": "Skin Care Concern", "value": "Vegetarians-NO,Vegans-NO,Coeliacs-NO,"}], "specifications": [{"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Vanilla"}, {"name": "Assembled Product Weight", "value": "4.29 lb"}, {"name": "Food Form", "value": "Liquids"}, {"name": "Brand", "value": "Great Value"}, {"name": "Model", "value": "11953"}, {"name": "Allergen-Free Statements", "value": "Dairy-Free"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "3.78 x 3.78 x 9.50 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "30", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "2.5g", "dvp": "4%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "0g", "dvp": "1%"}, {"name": "Trans Fat", "amount": "0g", "dvp": null}, {"name": "Polyunsaturated Fat", "amount": "0.5g", "dvp": null}, {"name": "Monounsaturated Fat", "amount": "1.5g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "0.0mg", "dvp": "0%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "170mg", "dvp": "7%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "1g", "dvp": "0%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "1g", "dvp": "2%"}, {"name": "Sugars", "amount": "0g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": "1g", "dvp": null}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": null, "dvp": "10%"}, {"name": "Vitamin C", "amount": null, "dvp": "0%"}, {"name": "Calcium", "amount": "450.0mg", "dvp": "45%"}, {"name": "Potassium", "amount": "170mg", "dvp": "5%"}, {"name": "Iron", "amount": null, "dvp": "4%"}, {"name": "Vitamin D", "amount": null, "dvp": "25%"}, {"name": "Vitamin E", "amount": null, "dvp": "20%"}, {"name": "Folic Acid", "amount": null, "dvp": "0%"}, {"name": "Phosphorus", "amount": null, "dvp": "2%"}, {"name": "Zinc", "amount": null, "dvp": "0%"}, {"name": "Copper", "amount": null, "dvp": "4%"}]}}}, "reviews": {"averageOverallRating": 3.8484, "customerReviews": [{"rating": 5.0, "reviewText": "Having been diabetic for 28 years, I have gone through a lot of different brand of almond milk. This by far has been my favorite and I have been buying it for a few years now. Wouldn't change unless they don't make it anymore."}, {"rating": 5.0, "reviewText": "I enjoy this unsweetened with muesli or oatmeal hot and room temp during the early evening as a meal. If needed, I add fresh or canned fruit and almost definitely a dollop of yogurt. Viola!"}, {"rating": 5.0, "reviewText": "The young man that loaded my car this morning also put the items in the bags I had brought. His name is George and he did such a good job. Was very pleasant and respectful. Not all helpers have asked about bagging the groceries for me even though I always bring bags. George doing that for me was such a help. Thank you George!!"}, {"rating": 5.0, "reviewText": "Love flavors.Been fighting high cholesterol, low in calories. Cholesterol has gone down with changing some habits....Almond milk being 1. Was 204 down to 147. Thumbs up!"}, {"rating": 5.0, "reviewText": "This is better than name brand almond milk and at a lower price. We tecently switched from 2% milk to this. My husband had cholesterol and the doctor recommended almond milk. We were a bit sketical, but pleasantly surprised. I love that its not thick either and only has30 calories. We add it to cereal and to make smoothies. Itsâ\u0080\u009dâ\u0080\u0099s actually pretty great!"}, {"rating": 1.0, "reviewText": "contains added phosphorus! not shown on the label or in the nutrition ingredients in the description on the website! this is critically important information for people who cannot have added phosphorus for kidney problems and other health reasons! I was ordering this all the time and then glanced at the label the other day and discovered tricalcium phosphate in the ingredients! it did not occur to me that the product would be different from what I had ordered online! very concerned and very disappointed!!!"}, {"rating": 1.0, "reviewText": "Milk was opened and leaking everywhere."}, {"rating": 1.0, "reviewText": "carton doesn't expire until January 28 but there's mold on inside of lid"}, {"rating": 1.0, "reviewText": "Ordered two half gallons of almond milk today and they both were expired"}, {"rating": 1.0, "reviewText": "This used to be the BEST almond milk for lattes. It frothed like a dream and had a creamy texture. About a month ago they must have changed the formula (more water???). Now, nothing. Please restore it to its former glory! I used to buy soo much of it."}], "totalReviewCount": 244}}, {"name": "Horizon Organic Whole DHA Omega-3 Milk, Half Gallon", "brand": "Horizon", "shortDescription": "<p>Treat your family to the goodness of Horizon Organic Whole Milk with DHA Omega-3. Rich, delicious taste isn’t the only thing that makes this milk special: it’s also wonderfully wholesome and made to meet the highest USDA Organic standards. Plus, each serving of this whole milk features 32mg of DHA Omega-3—a valuable nutrient that may help support brain and eye health—along with vitamin D, vitamin A, and protein.More than 20 years ago, we became the first company to supply organic milk nationwide—and we’ve remained committed to the organic movement ever since. Our USDA Certified Organic products are made with non-GMO ingredients, from cows that are given no antibiotics, no persistent pesticides, and no added hormones.* We strive to do good by our cows, too: they spend much of their time out in the pasture where they feel most at home, and graze on a diet that includes organic grass. It’s all part of our commitment to making better choices for ourselves, our cows, and our planet. *No significant difference has been shown between milk from rbST-treated & non rbST-treated cows.<p><b>Horizon Organic Whole DHA Omega-3 Milk, Half Gallon:</b>", "canonicalUrl": "https://www.walmart.com/ip/Horizon-Organic-Whole-DHA-Omega-3-Milk-Half-Gallon/19857008", "availabilityStatus": "IN_STOCK", "averageRating": 4.4, "priceInfo": {"currentPrice": {"price": 5.58, "priceString": "$5.58"}, "unitPrice": {"price": 0.087, "priceString": "8.7 ¢/fl oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Perishable. Keep refrigerated."}, {"name": "Safe Handling Instructions", "value": "Keep Refrigerated. Best if opened by the sell-date that's listed on the package. Once opened, consume within 7 days. Perishable."}], "indications": null, "specifications": [{"name": "Brand", "value": "Horizon"}, {"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Unflavored"}, {"name": "Food Allergen Statements", "value": "Contains Milk"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "3.81 x 3.81 x 9.25 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "170", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "9g", "dvp": "12%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "5g", "dvp": "25%"}, {"name": "Trans Fat", "amount": "0g", "dvp": null}, {"name": "Polyunsaturated Fat", "amount": "0.00g", "dvp": null}, {"name": "Monounsaturated Fat", "amount": "2.50g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "35.00mg", "dvp": "12%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "140mg", "dvp": "6%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "13g", "dvp": "5%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0g", "dvp": "0%"}, {"name": "Sugars", "amount": "11g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": "9g", "dvp": "18%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": "100.00M", "dvp": "10%"}, {"name": "Vitamin C", "amount": null, "dvp": "2%"}, {"name": "Calcium", "amount": "330.00mg", "dvp": "25%"}, {"name": "Potassium", "amount": "430mg", "dvp": "10%"}, {"name": "Iron", "amount": "0.00mg", "dvp": "0%"}, {"name": "Vitamin D", "amount": "2.50mcg", "dvp": "15%"}, {"name": "Riboflavin", "amount": "0.50mg", "dvp": "40%"}, {"name": "Vitamin B12", "amount": "1.30mg", "dvp": "50%"}, {"name": "Phosphorus", "amount": "250.00mg", "dvp": "20%"}, {"name": "Magnesium", "amount": null, "dvp": "6%"}]}}}, "reviews": {"averageOverallRating": 4.3542, "customerReviews": [{"rating": 5.0, "reviewText": "This milk is fresh, sweet and creamy."}, {"rating": 5.0, "reviewText": "This milk tastes great! It's nice to know what's going into your body. A safe organic great tasting milk. [This review was collected as part of a promotion.]"}, {"rating": 5.0, "reviewText": "I buy this milk for my toddler because I want him to have organic milk free from hormones and whatever else is out there.  I have tasted it myself and it is very smooth and good.  I love that it has added DHA and omega 3 which is so important for growing children!"}, {"rating": 5.0, "reviewText": "Wow. My daughter does not want regular milk anymore. This milk tastes like heaven. It lasts longer than the norm granted it's gone way before the expiration date."}, {"rating": 4.0, "reviewText": "Eat the milk with cereal. First time in a long time I didn't gas and upset stomach. I ate two bowls... [This review was collected as part of a promotion.]"}, {"rating": 4.0, "reviewText": "I'm a big fan of the health benefits of DHA. Horizon delivers quality taste AND that vital nutrient. This is an expensive indulgence, but one that I'm happy to make."}, {"rating": 1.0, "reviewText": "Make sure the expiration date of the products\nThe milk I received was expired 7/21/22"}, {"rating": 1.0, "reviewText": "Love whole milk, but the DHA and Omega 3 addition gives this milk a fishy flavor, especially when heated up (like in coffee)."}, {"rating": 1.0, "reviewText": "To my shock the milkskin is like plastic that is flammable. I tried to chew it and also kept it to fire. Being the doctors' suggested brand, i have been using it for my toddler which eventually turning out to be more dangerous. I couldn't share the video as i haven't uploaded in youtube yet ( fr the url)"}, {"rating": 1.0, "reviewText": "Bought this milk to make yogurt.  Wrong.  Apparently those good yogurt strains of organisms are totally turned off by fish oil.  Didn't notice the milk had this stuff in it. Made a batch of yogurt and it never set up.  Really. I avoid fish oil supplements; better to eat fresh fish.  Who thought of putting fish in milk?  Yikes!"}], "totalReviewCount": 144}}, {"name": "Lactaid 1% Lowfat Milk, 64 oz", "brand": "Lactaid", "shortDescription": "LACTAID® 1% Lowfat Milk contains essential nutrients like calcium, protein, and Vitamin D, with 70% less fat and 100% lactose free so you can enjoy it with no worries. Lactaid is farm-fresh milk from cows that are never treated with artificial growth hormones, and all our milk is tested for antibiotics. All the goodness of real milk, just without the lactose.", "canonicalUrl": "https://www.walmart.com/ip/Lactaid-1-Lowfat-Milk-64-oz/10801611", "availabilityStatus": "IN_STOCK", "averageRating": 4.5, "priceInfo": {"currentPrice": {"price": 4.86, "priceString": "$4.86"}, "unitPrice": {"price": 0.076, "priceString": "7.6 ¢/fl oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Keep refrigerated."}, {"name": "Safe Handling Instructions", "value": "Keep Refrigerated. Best if opened by the sell-date that's listed on the package. Once opened, consume within 7 days."}], "indications": [{"name": "Health Concern", "value": "Sensitive Stomach"}], "specifications": [{"name": "Features", "value": "Low fat, 1% milkfat, Lactose free, Ultra-pasteurized grade a, Vitamins a and d"}, {"name": "Brand", "value": "Lactaid"}, {"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Unflavored"}, {"name": "Food Allergen Statements", "value": "Gluten Free, Lactose Free, Soy Free, Milk"}, {"name": "Allergen-Free Statements", "value": "Tree Nut-Free, Shellfish-Free, Wheat-Free, Gluten-Free, Egg-Free, Lactose-Free, Soy /Soybean Free, Peanut-Free"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "3.98 x 4.00 x 9.60 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "110", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": null, "dvp": "4%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "1.5g", "dvp": "8%"}, {"name": "Trans Fat", "amount": "0g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "15.00mg", "dvp": "4%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "125mg", "dvp": "5%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "13.00000Grams", "dvp": "4%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0g", "dvp": "0%"}, {"name": "Sugars", "amount": "12g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": null, "dvp": "17%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": "150.00mcg", "dvp": "15%"}, {"name": "Vitamin C", "amount": null, "dvp": "0%"}, {"name": "Calcium", "amount": "300.00mg", "dvp": "25%"}, {"name": "Potassium", "amount": "410mg", "dvp": "8%"}, {"name": "Iron", "amount": "0.10mg", "dvp": "0%"}, {"name": "Vitamin D", "amount": "2.50mcg", "dvp": "15%"}, {"name": "Riboflavin", "amount": "0.40mg", "dvp": "30%"}, {"name": "Vitamin B12", "amount": "0.80mcg", "dvp": "35%"}, {"name": "Phosphorus", "amount": "240.00mg", "dvp": "20%"}]}}}, "reviews": {"averageOverallRating": 4.5439, "customerReviews": [{"rating": 5.0, "reviewText": "great flavor. even if you are not lactose intolerant this milk is way better! and it lasts way longer! you don't have a week or so expiration, you normally have a month and a half when you buy it! it lasts forever and it tastes so good, very refreshing"}, {"rating": 5.0, "reviewText": "I like to drink this milk, delicious without much fat, very good for health, very easy to drink. The product is really good. I'm very satisfied"}, {"rating": 5.0, "reviewText": "Since regular milk doesnt agree with me I decided to switch to Lactaid free.Satisfied with the change"}, {"rating": 5.0, "reviewText": "We don't have to compromise flavor because this is absolutely delicious and best of all low fat and lactose free. All the yums without the discomfort from regular milk!"}, {"rating": 4.0, "reviewText": "This product is usually good. However, I am writing this review not because of the quality of the product but the quality of the condition is was left in. This product arrived leaking. It was left in a puddle of milk."}, {"rating": 3.0, "reviewText": "Wasn't given my milk but was charged"}, {"rating": 1.0, "reviewText": "I ordered this 11/23 and it expired 11/21"}, {"rating": 1.0, "reviewText": "I didn't get my two cartons of milk"}, {"rating": 1.0, "reviewText": "There are a lot of milk but no any suggestion to replace?"}, {"rating": 1.0, "reviewText": "My experience with Lactaid is the most disgusting, gross, and disturbing experience I ever had. There was a small piece of yarn in the milk and I had it in my mouth when I was drinking this milk right away I felt disgusted, So I had to spit it out I literally wasted my money on this brand. I just switched to this milk a week ago This is DISAPPOINTING.HERE IS THE PICTURE FOR PROOFF!!!!!"}], "totalReviewCount": 171}}, {"name": "West Life Organic Unsweetened Vanilla Soymilk, 32 fl oz", "brand": "WestSoy", "shortDescription": "Westsoy Organic Unsweetened Vanilla Soymilk is deliciously nutricious - smooth and creamy soymilk made from organic whole soybeans and the perfect touch of vanilla flavor, all with 0g added sugars. Each cup has 9g of soy protein per serving. It's Lactose free, Dairy free, Vegan, Gluten Free, Certified Organic, and Non-GMO Project verified.  Westsoy Organic Unsweetened Vanilla Soymilk is deliciously satisfying by the glass, over cereal, or a good protein addition to a smoothie! It has convenient, shelf-stable packaging so you can keep it in your pantry and use it when you want to! Reminder, it must be refrigerated once opened.", "canonicalUrl": "https://www.walmart.com/ip/West-Life-Organic-Unsweetened-Vanilla-Soymilk-32-fl-oz/10322043", "availabilityStatus": "IN_STOCK", "averageRating": 4.1, "priceInfo": {"currentPrice": {"price": 3.24, "priceString": "$3.24"}, "unitPrice": {"price": 0.101, "priceString": "10.1 ¢/oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Serve chilled. After opening refrigerate and use within 7-10 days. Shake well."}], "indications": null, "specifications": [{"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Vanilla"}, {"name": "Assembled Product Weight", "value": "2 oz"}, {"name": "Food Form", "value": "Liquids"}, {"name": "Brand", "value": "WestSoy"}, {"name": "Model", "value": "V97083"}, {"name": "Allergen-Free Statements", "value": "Dairy-Free, Gluten-Free, Lactose-Free"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "3.75 x 2.38 x 7.69 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "100", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "5g", "dvp": "8%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "1g", "dvp": "5%"}, {"name": "Trans Fat", "amount": "0g", "dvp": null}, {"name": "Polyunsaturated Fat", "amount": "3.0g", "dvp": null}, {"name": "Monounsaturated Fat", "amount": "1.0g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "0.0mg", "dvp": "0%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "30mg", "dvp": "1%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "4g", "dvp": "1%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "1g", "dvp": "6%"}, {"name": "Sugars", "amount": "3g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": "9g", "dvp": "18%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": null, "dvp": "0%"}, {"name": "Vitamin C", "amount": null, "dvp": "0%"}, {"name": "Calcium", "amount": "0", "dvp": "0%"}, {"name": "Potassium", "amount": "390mg", "dvp": "11%"}, {"name": "Iron", "amount": "0.5mg", "dvp": "2%"}]}}}, "reviews": {"averageOverallRating": 4.1064, "customerReviews": [{"rating": 5.0, "reviewText": "This is pure soy milk without any of the other added stuff. I make yogurt with it and it turns out fabulous!"}, {"rating": 5.0, "reviewText": "Didn't like the consistency first try, but hadn't seen the directions to shake first. That made all the difference. Love it as creamer in my coffee!"}, {"rating": 5.0, "reviewText": "This soy milk is great. Much simpler ingredients than most of the plant milks, and I love the vanilla flavor."}, {"rating": 5.0, "reviewText": "Great consistency and taste. Healthy."}, {"rating": 5.0, "reviewText": "I love this soymilk and think it's the best one on the market. Reasons: it is just soy milk and vanilla, with no other additives. It's organic, and tastes great. Just the right texture and thickness and low sodium (lots of these kinds of drinks load them up with sodium). \n\nI drink a quart of this a day!"}, {"rating": 4.0, "reviewText": "Westsoy soy milk is great but a packing is not always good , sometimes they were put in plastic bag it keeps  the carton not dent but sometimes they did not so driver  throw a package it makes cartons are not in good shape . Should packed in plastic before put in an a box."}, {"rating": 4.0, "reviewText": "First-this is the best unsweetened vanilla soy milk. There are no weird ingredients and it has a good taste, and both at the same time are hard to find. Having said that, this is my 2nd time buying it by the case from Walmart. The first was great-arrived in perfect condition. But, this time so damaged it leaked on my floor and caused big problems. I have to return it to the store today-so disappointed."}, {"rating": 2.0, "reviewText": "A bit too much vanilla. Tasted funky."}, {"rating": 1.0, "reviewText": "This is what shipped. The new version doesn't froth for coffee."}, {"rating": 1.0, "reviewText": "BAD BATCH! expires 2023. purchased dec 2022. I have been drinking soy milk for 20 years; this tastes like PLASTIC. 3 sips. I am now sick to my stomach."}], "totalReviewCount": 47}}, {"name": "Parmalat 2% Reduced Fat Chocolate Milk, 32 fl oz", "brand": "Parmalat", "shortDescription": "Enjoy the fresh taste of high quality Grade A 2 percent milk fat cow's milk, with no preservatives. Parmalat milk is heated at higher temperatures than regular pasteurized milk. This way Parmalat milk stays fresh longer and doesn’t need to be refrigerated until opened. Parmalat milk is packed full of good things such as Vitamins A and D, protein, and calcium. What are the differences between Pasteurized milk, Ultra Pasteurized milk and Ultra High Temperature milk? It is the same milk, the only difference is in the pasteurization process and the packaging which impact shelf life.", "canonicalUrl": "https://www.walmart.com/ip/Parmalat-2-Reduced-Fat-Chocolate-Milk-32-fl-oz/907349540", "availabilityStatus": "IN_STOCK", "averageRating": 2.3, "priceInfo": {"currentPrice": {"price": 5.96, "priceString": "$5.96"}, "unitPrice": {"price": 0.186, "priceString": "18.6 ¢/fluid ounces"}}, "idml": {"directions": [{"name": "Instructions", "value": "Shake well. Best served chilled. For best taste, chill before serving. Refrigerate after opening. Use contents within 7 days of opening."}], "indications": null, "specifications": [{"name": "Brand", "value": "Parmalat"}, {"name": "Container Type", "value": "Carton"}, {"name": "Flavor", "value": "Chocolate"}, {"name": "Food Allergen Statements", "value": "Contains: Lactose, Dairy"}, {"name": "Allergen-Free Statements", "value": "Gluten-Free"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "3.75 x 2.38 x 8.38 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "180", "dvp": "-%"}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "5g", "dvp": "6%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "3g", "dvp": "15%"}, {"name": "Trans Fat", "amount": "0g", "dvp": "-%"}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "20mg", "dvp": "7%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "150mg", "dvp": "6%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "26g", "dvp": "9%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0g", "dvp": "1%"}, {"name": "Sugars", "amount": "25g", "dvp": "-%"}]}, {"mainNutrient": {"name": "Protein", "amount": "7g", "dvp": "15%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": "90mcg", "dvp": "10%"}, {"name": "Calcium", "amount": "263mg", "dvp": "20%"}, {"name": "Potassium", "amount": "405mg", "dvp": "8%"}, {"name": "Iron", "amount": "1mg", "dvp": "2%"}, {"name": "Vitamin D", "amount": "160.0mcg", "dvp": "20%"}]}}}, "reviews": {"averageOverallRating": 2.3333, "customerReviews": [{"rating": 3.0, "reviewText": null}, {"rating": 3.0, "reviewText": null}, {"rating": 1.0, "reviewText": null}], "totalReviewCount": 3}}, {"name": "Great Value 1% Low-Fat Milk, Half Gallon, 64 fl oz", "brand": "Great Value", "shortDescription": "<p>This Grade A quality milk is pasteurized and delivers fresh from the farm taste. This kitchen staple is great for using in cereal, to bake desserts and more. This gallon of milk is also wonderful for milkshakes, smoothies, chocolate milk and more. Enjoy a delicious classic and serve a cold glass of this milk with soft, chocolate chip cookies for dipping. It offers an abundance of nutritional benefits as it is a rich source of protein, calcium, potassium and vitamins A and D. It is great for health conscious individuals as it low in fat. Our farms have pledged to not treat any cows with any artificial growth hormones. Great Value products provide families with affordable, high quality grocery and household consumable options. With our wide range of product categories spanning grocery and household consumables, we offer you a variety of products for your family's needs. Our products are conveniently available online and in Walmart stores nationwide, allowing you to stock up and save money at the same time.</p>", "canonicalUrl": "https://www.walmart.com/ip/Great-Value-1-Low-Fat-Milk-Half-Gallon-64-fl-oz/10804537", "availabilityStatus": "IN_STOCK", "averageRating": 2.8, "priceInfo": {"currentPrice": {"price": 1.66, "priceString": "$1.66"}, "unitPrice": {"price": 0.026, "priceString": "2.6 ¢/fl oz"}}, "idml": {"directions": [{"name": "Instructions", "value": "Keep refrigerated."}, {"name": "Safe Handling Instructions", "value": "PERISHABLE KEEP REFRIGERATED"}], "indications": [{"name": "Skin Care Concern", "value": "Vegans-NO,"}], "specifications": [{"name": "Features", "value": "Vitamin a And d, 1% lowfat, Homogenized, Grade a, Pasteurized"}, {"name": "Brand", "value": "Great Value"}, {"name": "Container Type", "value": "Jug"}, {"name": "Flavor", "value": "Unflavor"}, {"name": "Food Allergen Statements", "value": "Contains Milk"}, {"name": "Allergen-Free Statements", "value": "Gluten-Free"}, {"name": "Assembled Product Dimensions (L x W x H)", "value": "3.80 x 3.80 x 9.90 Inches"}], "nutritionFacts": {"calorieInfo": {"mainNutrient": {"name": "Calories", "amount": "110", "dvp": null}, "childNutrients": null}, "keyNutrients": {"values": [{"mainNutrient": {"name": "Total Fat", "amount": "2.5g", "dvp": "3%"}, "childNutrients": [{"name": "Saturated Fat", "amount": "1.5g", "dvp": "8%"}, {"name": "Trans Fat", "amount": "0g", "dvp": null}, {"name": "Polyunsaturated Fat", "amount": "0.0g", "dvp": null}, {"name": "Monounsaturated Fat", "amount": "0.5g", "dvp": null}]}, {"mainNutrient": {"name": "Cholesterol", "amount": "10.0mg", "dvp": "4%"}, "childNutrients": null}, {"mainNutrient": {"name": "Sodium", "amount": "130mg", "dvp": "5%"}, "childNutrients": null}, {"mainNutrient": {"name": "Total Carbohydrate", "amount": "13g", "dvp": "5%"}, "childNutrients": [{"name": "Dietary Fiber", "amount": "0g", "dvp": "0%"}, {"name": "Sugars", "amount": "12g", "dvp": null}]}, {"mainNutrient": {"name": "Protein", "amount": "8g", "dvp": "16%"}, "childNutrients": null}]}, "vitaminMinerals": {"mainNutrient": null, "childNutrients": [{"name": "Vitamin A", "amount": "143.0mcg", "dvp": "15%"}, {"name": "Vitamin C", "amount": null, "dvp": "4%"}, {"name": "Calcium", "amount": null, "dvp": "30%"}, {"name": "Potassium", "amount": "400mg", "dvp": "12%"}, {"name": "Iron", "amount": null, "dvp": "0%"}, {"name": "Vitamin D", "amount": null, "dvp": "25%"}, {"name": "Folic Acid", "amount": null, "dvp": "0%"}]}}}, "reviews": {"averageOverallRating": 2.7904, "customerReviews": [{"rating": 2.0, "reviewText": "Order picked up 5/8, the 1/2 Gallon of 1% milk has Use By date of 5/11...just not right"}, {"rating": 1.0, "reviewText": "Was purchased on 7/6 and the best by date was 7/21 and today is 7/17.  Today was the first day we opened it and this milk was sour.  My husband took a huge drink of it and it tasted old and sour. He emptied the carton before I could take pictures but you can see the best by date."}, {"rating": 1.0, "reviewText": "The milk expires in 4 days. Why would you choose milk that is about to expire?  Today is 2/24 and the milk expires on 2/28!"}, {"rating": 1.0, "reviewText": "Received the 7th and milk expired the 9th. My wife did not notice and almost threw up today ( a week after the order)."}, {"rating": 1.0, "reviewText": "Milk was expired we received it last Saturday"}, {"rating": 1.0, "reviewText": "Today is Aug 23 and this is also the expiration date of the milk."}, {"rating": 1.0, "reviewText": "Both expired 12/19 delivered on 12/22"}, {"rating": 1.0, "reviewText": "I was given milk the expired a week ago on 4/623"}, {"rating": 1.0, "reviewText": "There was a hole at the bottom of my milk leaked out everywhere I made a mess!"}, {"rating": 1.0, "reviewText": "My Great Value 1% milk\nHas been spoiling several days before expiration date and i have beep pouring out about half the container."}], "totalReviewCount": 544}}]